// 1) Выведите в консоль четные числа от 2 до 12, используйте цикл for и условие.

// for (let i = 2; i <= 12; i++){
//     if (i % 2 == 0) {
//         console.log(i);
//     }
// };

// 2) При помощи цикла for выведите в консоль числа от 10 до 1, в обратном порядке.

// for (let i = 10; i >=1; i--){
//     console.log(i);
// };

// 3) Перепишите 1 и 2 цикл используя цикл while.


// let i = 0
// while(i <= 12) {
//     i++;
//     if(i % 2 == 0) 
//     console.log(i)
// };


// let i = 10
// do{
//     console.log(i);
//     i--
// }while (i >= 1)





